IRP/src/Catalogs/Specifications/Specifications.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Specifications</name>
  <attributes>
    <name>Type</name>
    <type>
      <types>EnumRef.SpecificationType</types>
    </type>
  </attributes>
  <attributes>
    <name>ItemBundle</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>UniqueMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>DataSet</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
        <types>CatalogRef.ItemTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Attribute</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DataQuantity</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ItemKeys</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
      <types>CatalogRef.Boxes</types>
    </type>
  </attributes>
  <attributes>
    <name>Unit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>Specification</name>
    <type>
      <types>CatalogRef.Specifications</types>
    </type>
  </attributes>
  <attributes>
    <name>AffectPricingMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UniqueMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>SpecificationAffectPricingMD5</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>AffectPricingMD5</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/Specifications/ObjectModule.bsl
Procedure OnWrite(Cancel)
	If Not (ThisObject.AdditionalProperties.Property("SynhronizeAffectPricingMD5")
		And Not ThisObject.AdditionalProperties.SynhronizeAffectPricingMD5) Then
		Catalogs.ItemKeys.SynhronizeAffectPricingMD5BySpecification(ThisObject.Ref);
	EndIf;
EndProcedure

Procedure BeforeWrite(Cancel)
	Query = New Query();
	Query.Text = 
	"SELECT
	|	SpecificationsDataSet.Key AS Key,
	|	SpecificationsDataSet.Item AS Item,
	|	SpecificationsDataSet.Attribute AS Attribute,
	|	SpecificationsDataSet.Value AS Value
	|INTO tmp_DataSet
	|FROM
	|	&DataSet AS SpecificationsDataSet
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	SpecificationsDataQuantity.Key AS Key,
	|	SpecificationsDataQuantity.Quantity AS Quantity
	|INTO tmp_DataQuantity
	|FROM
	|	&DataQuantity AS SpecificationsDataQuantity
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|SELECT
	|	tmp_DataSet.Item AS Item,
	|	tmp_DataSet.Attribute AS Property,
	|	tmp_DataSet.Value AS Value,
	|	tmp_DataQuantity.Quantity AS Quantity
	|FROM
	|	tmp_DataSet AS tmp_DataSet
	|		INNER JOIN tmp_DataQuantity AS tmp_DataQuantity
	|		ON tmp_DataSet.Key = tmp_DataQuantity.Key";
	Query.SetParameter("DataSet", ThisObject.DataSet.Unload());
	Query.SetParameter("DataQuantity", ThisObject.DataQuantity.Unload());
	QueryResult = Query.Execute();
	ThisObject.UniqueMD5 = AddAttributesAndPropertiesServer.GetMD5BySpecification(QueryResult.Unload());
	If ValueIsFilled(UniqueID.FindRefByUniqueMD5(ThisObject, ThisObject.UniqueMD5)) Then
		Cancel = True;
		CommonFunctionsClientServer.ShowUsersMessage(R().Error_066);
	EndIf;
EndProcedure
